## Staging: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 12 to add, 6 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| update   | `aws_glue_job.bes_crm_salesforce`                              |
|          | `aws_glue_job.platform_gc_forms_job`                           |
|          | `aws_glue_job.platform_gc_notify_job`                          |
|          | `aws_glue_job.platform_support_freshdesk`                      |
|          | `aws_glue_resource_policy.cross_account_access`                |
|          | `aws_s3_object.platform_gc_notify_tables`                      |
| recreate | `aws_glue_catalog_database.bes_crm_salesforce_production`      |
|          | `aws_glue_catalog_database.operations_aws_production`          |
|          | `aws_glue_catalog_database.operations_aws_production_raw`      |
|          | `aws_glue_catalog_database.platform_gc_forms_production`       |
|          | `aws_glue_catalog_database.platform_gc_forms_production_raw`   |
|          | `aws_glue_catalog_database.platform_gc_notify_production`      |
|          | `aws_glue_catalog_database.platform_support_production`        |
|          | `aws_glue_catalog_database.platform_support_production_raw`    |
|          | `aws_glue_crawler.operations_aws_production_account_tags`      |
|          | `aws_glue_crawler.operations_aws_production_cost_usage_report` |
|          | `aws_glue_crawler.platform_gc_forms_templates_production_raw`  |
|          | `aws_glue_crawler.platform_support_freshdesk_production`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_glue_catalog_database.bes_crm_salesforce_production must be replaced
-/+ resource "aws_glue_catalog_database" "bes_crm_salesforce_production" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/bes_crm_salesforce_production" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:bes_crm_salesforce_production" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "bes_crm_salesforce_production" -> "bes_crm_salesforce_staging" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.operations_aws_production must be replaced
-/+ resource "aws_glue_catalog_database" "operations_aws_production" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/operations_aws_production" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:operations_aws_production" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "operations_aws_production" -> "operations_aws_staging" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.operations_aws_production_raw must be replaced
-/+ resource "aws_glue_catalog_database" "operations_aws_production_raw" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/operations_aws_production_raw" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:operations_aws_production_raw" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "operations_aws_production_raw" -> "operations_aws_staging_raw" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.platform_gc_forms_production must be replaced
-/+ resource "aws_glue_catalog_database" "platform_gc_forms_production" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_forms_production" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:platform_gc_forms_production" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "platform_gc_forms_production" -> "platform_gc_forms_staging" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.platform_gc_forms_production_raw must be replaced
-/+ resource "aws_glue_catalog_database" "platform_gc_forms_production_raw" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_forms_production_raw" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:platform_gc_forms_production_raw" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "platform_gc_forms_production_raw" -> "platform_gc_forms_staging_raw" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.platform_gc_notify_production must be replaced
-/+ resource "aws_glue_catalog_database" "platform_gc_notify_production" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_notify_production" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:platform_gc_notify_production" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "platform_gc_notify_production" -> "platform_gc_notify_staging" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.platform_support_production must be replaced
-/+ resource "aws_glue_catalog_database" "platform_support_production" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/platform_support_production" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:platform_support_production" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "platform_support_production" -> "platform_support_staging" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_catalog_database.platform_support_production_raw must be replaced
-/+ resource "aws_glue_catalog_database" "platform_support_production_raw" {
      ~ arn          = "arn:aws:glue:ca-central-1:454671348950:database/platform_support_production_raw" -> (known after apply)
      ~ catalog_id   = "454671348950" -> (known after apply)
      ~ id           = "454671348950:platform_support_production_raw" -> (known after apply)
      + location_uri = (known after apply)
      ~ name         = "platform_support_production_raw" -> "platform_support_staging_raw" # forces replacement
      - parameters   = {} -> null
      - tags         = {} -> null
        # (2 unchanged attributes hidden)

      ~ create_table_default_permission (known after apply)
      - create_table_default_permission {
          - permissions = [
              - "ALL",
            ] -> null

          - principal {
              - data_lake_principal_identifier = "IAM_ALLOWED_PRINCIPALS" -> null
            }
        }
    }

  # aws_glue_crawler.operations_aws_production_account_tags must be replaced
-/+ resource "aws_glue_crawler" "operations_aws_production_account_tags" {
      ~ arn                    = "arn:aws:glue:ca-central-1:454671348950:crawler/Operations / AWS / Organization / Account Tags" -> (known after apply)
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (2 unchanged attributes hidden)
            }
        )
      ~ database_name          = "operations_aws_production_raw" -> "operations_aws_staging_raw" # forces replacement
      ~ id                     = "Operations / AWS / Organization / Account Tags" -> (known after apply)
        name                   = "Operations / AWS / Organization / Account Tags"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::454671348950:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.operations_aws_production_cost_usage_report must be replaced
-/+ resource "aws_glue_crawler" "operations_aws_production_cost_usage_report" {
      ~ arn                    = "arn:aws:glue:ca-central-1:454671348950:crawler/Operations / AWS / Cost and Usage Report" -> (known after apply)
      - classifiers            = [] -> null
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (2 unchanged attributes hidden)
            }
        )
      ~ database_name          = "operations_aws_production_raw" -> "operations_aws_staging_raw" # forces replacement
      ~ id                     = "Operations / AWS / Cost and Usage Report" -> (known after apply)
        name                   = "Operations / AWS / Cost and Usage Report"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::454671348950:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (5 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.platform_gc_forms_templates_production_raw must be replaced
-/+ resource "aws_glue_crawler" "platform_gc_forms_templates_production_raw" {
      ~ arn                    = "arn:aws:glue:ca-central-1:454671348950:crawler/Platform / GC Forms / Templates" -> (known after apply)
      - classifiers            = [] -> null
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (2 unchanged attributes hidden)
            }
        )
      ~ database_name          = "platform_gc_forms_production_raw" -> "platform_gc_forms_staging_raw" # forces replacement
      ~ id                     = "Platform / GC Forms / Templates" -> (known after apply)
        name                   = "Platform / GC Forms / Templates"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::454671348950:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (5 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_crawler.platform_support_freshdesk_production must be replaced
-/+ resource "aws_glue_crawler" "platform_support_freshdesk_production" {
      ~ arn                    = "arn:aws:glue:ca-central-1:454671348950:crawler/Platform / Support / Freshdesk" -> (known after apply)
      ~ configuration          = jsonencode(
          ~ {
              ~ Version              = 1.0 -> 1
                # (3 unchanged attributes hidden)
            }
        )
      ~ database_name          = "platform_support_production_raw" -> "platform_support_staging_raw" # forces replacement
      ~ id                     = "Platform / Support / Freshdesk" -> (known after apply)
        name                   = "Platform / Support / Freshdesk"
      ~ role                   = "service-role/AWSGlueCrawler-DataLake" -> "arn:aws:iam::454671348950:role/service-role/AWSGlueCrawler-DataLake"
      - tags                   = {} -> null
        # (6 unchanged attributes hidden)

      - lake_formation_configuration {
          - use_lake_formation_credentials = false -> null
            # (1 unchanged attribute hidden)
        }

      - lineage_configuration {
          - crawler_lineage_settings = "DISABLE" -> null
        }

      - recrawl_policy {
          - recrawl_behavior = "CRAWL_EVERYTHING" -> null
        }

      ~ s3_target {
          - exclusions          = [] -> null
          - sample_size         = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - schema_change_policy {
          - delete_behavior = "DEPRECATE_IN_DATABASE" -> null
          - update_behavior = "UPDATE_IN_DATABASE" -> null
        }
    }

  # aws_glue_job.bes_crm_salesforce will be updated in-place
  ~ resource "aws_glue_job" "bes_crm_salesforce" {
      ~ default_arguments         = {
          ~ "--database_name_transformed"        = "bes_crm_salesforce_production" -> "bes_crm_salesforce_staging"
            # (14 unchanged elements hidden)
        }
        id                        = "BES / CRM / Salesforce"
        name                      = "BES / CRM / Salesforce"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.platform_gc_forms_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_forms_job" {
      ~ default_arguments         = {
          ~ "--database_name_raw"                = "platform_gc_forms_production_raw" -> "platform_gc_forms_staging_raw"
          ~ "--database_name_transformed"        = "platform_gc_forms_production" -> "platform_gc_forms_staging"
            # (14 unchanged elements hidden)
        }
        id                        = "Platform / GC Forms"
        name                      = "Platform / GC Forms"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.platform_gc_notify_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_notify_job" {
      ~ default_arguments         = {
          ~ "--database_name_transformed"        = "platform_gc_notify_production" -> "platform_gc_notify_staging"
            # (18 unchanged elements hidden)
        }
        id                        = "Platform / GC Notify"
        name                      = "Platform / GC Notify"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_job.platform_support_freshdesk will be updated in-place
  ~ resource "aws_glue_job" "platform_support_freshdesk" {
      ~ default_arguments         = {
          ~ "--database_name_raw"                = "platform_support_production_raw" -> "platform_support_staging_raw"
          ~ "--database_name_transformed"        = "platform_support_production" -> "platform_support_staging"
            # (14 unchanged elements hidden)
        }
        id                        = "Platform / Support / Freshdesk"
        name                      = "Platform / Support / Freshdesk"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_glue_resource_policy.cross_account_access will be updated in-place
  ~ resource "aws_glue_resource_policy" "cross_account_access" {
        id     = "ca-central-1"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::257394494478:role/SupersetAthenaRead-bes_crm_salesforce_production" -> []
                        }
                      ~ Resource  = [
                          ~ "arn:aws:glue:ca-central-1:454671348950:table/bes_crm_salesforce_production/*" -> "arn:aws:glue:ca-central-1:454671348950:table/bes_crm_salesforce_staging/*",
                          ~ "arn:aws:glue:ca-central-1:454671348950:database/bes_crm_salesforce_production" -> "arn:aws:glue:ca-central-1:454671348950:database/bes_crm_salesforce_staging",
                            "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      ~ Sid       = "SupersetReadAccessBesCrmSalesforceProduction" -> "SupersetReadAccessBesCrmSalesforceStaging"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::257394494478:role/SupersetAthenaRead-operations_aws_production",
                              - "arn:aws:iam::066023111852:role/SupersetAthenaRead-operations_aws_production",
                            ]
                        }
                      ~ Resource  = [
                          ~ "arn:aws:glue:ca-central-1:454671348950:table/operations_aws_production/*" -> "arn:aws:glue:ca-central-1:454671348950:table/operations_aws_staging/*",
                          ~ "arn:aws:glue:ca-central-1:454671348950:database/operations_aws_production" -> "arn:aws:glue:ca-central-1:454671348950:database/operations_aws_staging",
                            "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      ~ Sid       = "SupersetReadAccessOperationsAwsProduction" -> "SupersetReadAccessOperationsAwsStaging"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_production",
                              - "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_gc_forms_production",
                            ] -> "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_forms_staging"
                        }
                      ~ Resource  = [
                          ~ "arn:aws:glue:ca-central-1:454671348950:table/platform_gc_forms_production/*" -> "arn:aws:glue:ca-central-1:454671348950:table/platform_gc_forms_staging/*",
                          ~ "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_forms_production" -> "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_forms_staging",
                            "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      ~ Sid       = "SupersetReadAccessPlatformGcFormsProduction" -> "SupersetReadAccessPlatformGcFormsStaging"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_notify_production" -> "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_gc_notify_staging"
                        }
                      ~ Resource  = [
                          ~ "arn:aws:glue:ca-central-1:454671348950:table/platform_gc_notify_production/*" -> "arn:aws:glue:ca-central-1:454671348950:table/platform_gc_notify_staging/*",
                          ~ "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_notify_production" -> "arn:aws:glue:ca-central-1:454671348950:database/platform_gc_notify_staging",
                            "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      ~ Sid       = "SupersetReadAccessPlatformGcNotifyProduction" -> "SupersetReadAccessPlatformGcNotifyStaging"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_support_production",
                              - "arn:aws:iam::066023111852:role/SupersetAthenaRead-platform_support_production",
                            ] -> "arn:aws:iam::257394494478:role/SupersetAthenaRead-platform_support_staging"
                        }
                      ~ Resource  = [
                          ~ "arn:aws:glue:ca-central-1:454671348950:table/platform_support_production/*" -> "arn:aws:glue:ca-central-1:454671348950:table/platform_support_staging/*",
                          ~ "arn:aws:glue:ca-central-1:454671348950:database/platform_support_production" -> "arn:aws:glue:ca-central-1:454671348950:database/platform_support_staging",
                            "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      ~ Sid       = "SupersetReadAccessPlatformSupportProduction" -> "SupersetReadAccessPlatformSupportStaging"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
    }

  # aws_s3_object.platform_gc_notify_tables will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_tables" {
      ~ etag                          = "c18e893fa3df1857763c6f192e9c882d" -> "1e0d0fd7ff8f913b1ea0269991045aef"
        id                            = "platform/gc_notify/tables.zip"
        tags                          = {}
      ~ version_id                    = "fNOY5ktI.C9PkhcrlhYjUXBVQdHfRCvE" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 12 to add, 6 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
